SCREEN 0, , 2, 2
WIDTH 80, 25
LOCATE , , 0, 1, 0
COLOR 14, 1
CLS
PRINT
PRINT
PRINT "                                                    ²²² ²²²                     "
PRINT "                                               ²²²  ²²² ²²²          ²²²        "
PRINT "                                           ²²² ²²²  ²²² ²²²          ²²²        "
PRINT "                                       ²²²²²²² ²²²  ²²² ²²²      ²²² ²²²        "
PRINT "                                       ²²  ²²² ²²²  ²²² ²²²      ²²² ²²²        "
PRINT "                                       ²²²²²²² ²²²  ²²² ²²²  ²²² ²²² ²²²        "
PRINT "               ²²ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ²²²²²      ²²²²²²²²²²²²      ²²² ²²² ²²²        "
PRINT "                                ²²²²²ÿÿ²²²ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ²²²ÿ²²²ÿ²²²ÿ²²²        "
PRINT "                   ²²²ÿÿÿ²²²²ÿÿÿÿÿ²²²ÿÿ²²²ÿÿ²²²ÿÿÿÿÿ²²²²ÿ²²²ÿ²²²ÿ²²²ÿ²²²        "
PRINT "          ²²²ÿÿÿÿÿÿ²²²²²²²²²²²²²²²²²²ÿÿ²²²ÿÿ²²²ÿ²²²²²²²²²²²²²²²²²²²²²²²²        "
PRINT "          ²²²ÿÿÿÿÿÿ²²²ÿÿÿ²²²²ÿÿÿÿÿÿÿÿÿÿ²²²ÿÿ²²²ÿÿÿÿÿ²²²²                        "
PRINT "          ²²²ÿÿÿÿÿÿ²²²ÿÿÿÿÿÿÿÿÿÿÿÿ²²²ÿÿ²²²ÿÿ²²²ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ²²           "
PRINT "          ²²²²²²²²²²²²ÿÿÿÿÿÿÿ²²²²²²²²²²²²²ÿÿ²²²ÿÿ²²²ÿ²²²                        "
PRINT "          ²²²²²²²²²²²²ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ²²²ÿÿ²²²ÿ²²²                        "
PRINT "                           ²²²²²ÿÿÿÿÿ²²²ÿÿÿÿÿÿÿÿÿ²²²ÿ²²²                        "
PRINT "                      ²²²ÿÿ²²²²²ÿÿÿÿÿ²²²²²²²²²²²²²²²ÿ²²²                        "
PRINT "              ²²²²ÿÿÿÿ²²²ÿÿÿÿ²²²ÿÿÿÿÿ²²²ÿÿÿÿÿÿÿÿÿÿÿÿÿ²²²                        "
PRINT "          ²²²²²²²²²²²²²²²²²²²²²²ÿÿÿÿÿ²²²ÿÿÿÿÿÿÿÿÿÿÿÿÿ²²²                        "
PRINT "              ²²²²ÿÿÿÿÿÿÿÿÿÿÿÿÿÿÿ²²²²²²²                                        "
PRINT "                    ²²ÿ²²                                                       "
LOCATE 25, 1: COLOR 15
PRINT "  Program by FARHAN ALI QURESHI                                (Press any key)  ";
WHILE INKEY$ <> "": WEND

TimeLimit = 3
IF COMMAND$ <> "" THEN TimeLimit = VAL(COMMAND$)
StartTime = TIMER
DO
    IF TIMER - StartTime >= TimeLimit THEN EXIT DO
    IF INKEY$ <> "" THEN EXIT DO
LOOP

COLOR 7, 0
CLS
SCREEN 0, , 1, 1

